import {CompanyStateInterface} from "./type";

const localStorageList = localStorage.getItem('company')
const list = {
    0: {
        "name": "Инновации Эрат",
        "address": "34415 Точка Харпера, Сюита 207\nНовый Брэндон, ВАЙ 34698",
    },
    1: {
        "name": "Руссо, Хейз и Литтл",
        "address": "81333 Моника Роуд\nВест Роберт, КА 66149"
    },
    2: {
        "name": "Шмеллер-Харбер",
        "address": "64433 Острова Дерека, Квартира 221\nПорт Кеннет, ОН 56230",
    },
    3: {
        "name": "Кронин-Сванявски",
        "address": "43206 Джаст Джанкшен\nОзеро Брианна, РИ 38936",
    },
    4: {
        "name": "Харбер, Кроно и Джаст",
        "address": "56107 Джаст Аллей\nНовый Саравью, МА 37938",
    },
    5: {
        "name": "Люттген ЛЛС",
        "address": "37292 Драйв Каммингса\nВест Хантер, МТ 13308",
    },
    6: {
        "name": "Шмеллер, Винтайзер и Сайпс",
        "address": "58403 Стрэвю Мюрфи\nВест Леон, КА 23946",
    },
    7: {
        "name": "Кроно-Хауэлл",
        "address": "92744 Горы Райана\nОзеро Диланмаут, НД 64868",
    },
    8: {
        "name": "Томпсон Групп",
        "address": "03701 Джаст Роуд\nНовый Дэвид, НХ 31116",
    },
    9: {
        "name": "Джаст, Джаст и Трантов",
        "address": "48301 Стрэвю Даниэла\nНовый Джон, КС 32590",
    },
    10: {
        "name": "Сайпс-Люттген",
        "address": "32573 Квадраты Грэди\nСаут Мелисса, ГА 79502",
    },
    11: {
        "name": "Винтайзер-Хауэлл",
        "address": "15698 Джаст Вью\nИст Кайл, МИ 74946"
    },
    12: {
        "name": "Клинг, Трантов и Каутцер",
        "address": "50887 Даглас Стрим\nОзеро Элайджа, ФЛ 88374",
    },
    13: {
        "name": "Руэкер ЛЛС",
        "address": "97890 Грант Айл\nИст Эли, АЛ 85899",
    },
    14: {
        "name": "Коепп, Каммингс и Шмеллер",
        "address": "04441 О'Коннелл Поинт\nОзеро Джейкоб, ЛА 13554",
    },
    15: {
        "name": "Каутцер Групп",
        "address": "84313 Джаст Вэй\nОзеро Эмили, ИД 86799"
    },
    16: {
        "name": "Харбер Инк",
        "address": "66997 Долина Килинга, Сюита 343\nСаут Виллиам, АЛ 81668",
    },
    17: {
        "name": "Люттген Групп",
        "address": "93206 Мельницы Кронина\nПорт Кевин, ФЛ 04503",
    },
    18: {
        "name": "Кроно Инк",
        "address": "07701 Долина Марвина, Сюита 333\nНовая Моника, СТ 76495",
    },
    19: {
        "name": "Каммингс, Джаст и Харбер",
        "address": "71759 Кроно Фривэй, Квартира 224\nНорт Элизабет, СТ 67154",
    },
    20: {
        "name": "Джаст Инк",
        "address": "39730 Эммет Инлет, Сюита 509\nНорт Кристофер, РИ 64601",
    },
    21: {
        "name": "Винтайзер-Хауэлл",
        "address": "69520 Джанкшен Дойла\nВест Джереми, ТН 60129",
    },
    22: {
        "name": "Шмеллер, Джаст и Коепп",
        "address": "05098 Кроно Прери\nСаут Шон, ВИ 39794",
    },
    23: {
        "name": "Харбер ЛЛС",
        "address": "81708 Эммет Вэлли\nНовая Саравиль, ИЛ 11446",
    },
    24: {
        "name": "Харбер, Шмеллер и Люттген",
        "address": "50058 Аннабель Луп\nНовый Джастин, МО 15581",
    },
    25: {
        "name": "Кронин-Шмеллер",
        "address": "05137 Николас Джанкшен\nНорт Чарльз, ДЕ 64011",
    },
    26: {
        "name": "Каутцер, Джаст и Джаст",
        "address": "94699 Джаст Фривэй, Сюита 405\nСаут Джонатан, КИ 83277",
    },
    27: {
        "name": "Трантов, Трантов и Люттген",
        "address": "11549 О'Хара Гроув\nОзеро Джозеф, ИЛ 25559",
    },
    28: {
        "name": "Шмеллер-Харбер",
        "address": "64433 Острова Дерека, Квартира 221\nПорт Кеннет, ОН 56230",
    },
    29: {
        "name": "Кронин-Сванявски",
        "address": "43206 Джаст Джанкшен\nОзеро Брианна, РИ 38936",
    }
}


export const initialState: CompanyStateInterface = {
    list: localStorageList ? JSON.parse(localStorageList) : list,
    selected: [],
    page: 1,
}







